#include<stdio.h>
int main(void) {
	int max = 0, a[3] = {};
	for (int i = 0; i < 3; i++) {
		scanf("%d", &a[i]);
	}
	
	if (a[0] == a[1] && a[1] == a[2] && a[0] == a[2]) {	//전부 같을 때
		printf("%d\n", 10000 + a[0] * 1000);
	}
	else if (a[0] != a[1] && a[1] != a[2] && a[0] != a[2]) {	//전부 다를 때
		max = ((a[0] > a[1]) && (a[0] > a[2])) ? a[0] : ((a[1] > a[0]) && (a[1] > a[2])) ? a[1] : a[2];
		printf("%d\n", max * 100);
	}
	else if (a[0] == a[1] && a[1] != a[2] && a[0] != a[2]) {	//첫번째랑 두번째만 같을 때
		printf("%d\n", 1000 + a[0] * 100);
	}
	else if (a[0] != a[1] && a[1] == a[2] && a[0] != a[2]) {	//두번째랑 세번째만 같을 때
		printf("%d\n", 1000 + a[1] * 100);
	}
	else if (a[0] != a[1] && a[1] != a[2] && a[0] == a[2]) {	//첫번째랑 세번째만 같을 때
		printf("%d\n", 1000 + a[2] * 100);
	}
}